{  "name": "Classic Hungarian-style Beef Goulash (no peppers)",
  "ingredients": [
    "1 kg beef chuck or shin, cut into 2-3 cm cubes",
    "3 large onions (approx. 600 g), finely sliced",
    "3-4 cloves garlic, minced",
    "3 medium carrots (approx. 300 g), diced",
    "2-3 medium potatoes (approx. 500 g), peeled and cut into cubes (optional, traditional in many versions)",
    "1 tsp hot paprika or a pinch of cayenne (optional, for mild heat)",
    "2 tbsp lard or vegetable oil",
    "2 bay leaves",
    "1.5–2 L beef stock or water (enough to cover)",
    "Salt and black pepper to taste",
    "Optional: 1–2 tbsp tomato paste",
     "1.5 kg floury potatoes (e.g., Russet, King Edward, or Maris Piper)",
    "200–250 g butter (yes, really – this is the rich version)",
    "300–400 ml whole milk or half milk/half cream, warmed",
    "Salt and white pepper to taste"
  ],
   "instructions": [
    "Make the goulash:",
    "1. Heat lard/oil in a large heavy pot. Add onions and cook slowly 15–20 min until deep golden.",
    "2. Add garlic and caraway seeds, cook 1 min.",
    "3. Remove from heat, stir in all the sweet paprika (and hot if using) to coat onions.",
    "4. Return to heat, add beef, season well, then add carrots, bay leaves, tomato paste, and enough hot stock to cover by 3–4 cm.",
    "5. Simmer very gently (covered) for 2–2.5 hours until beef is almost tender. Remove lid for the last 30–45 min to thicken the sauce. Taste and adjust seasoning.",
    "",
    "Make the butter-rich mashed potatoes (start when goulash has about 40 min left):",
    "6. Peel potatoes and cut into even chunks. Boil in salted water until completely tender (15–20 min).",
    "7. Drain very well, return to the hot pot and let steam dry for 2 minutes.",
    "8. Warm the milk/cream. Start mashing or use a ricer.",
    "9. Add the 200–250 g butter in chunks and beat in until melted and silky.",
    "10. Gradually pour in the warm milk while beating until you reach your desired creamy consistency. Season generously with salt and a little white pepper.",
    "11. Keep warm (cover with a lid or place over a pot of simmering water).",
    "",
    "To serve:",
    "Spoon a generous mound of the buttery mashed potatoes into deep plates or bowls, make a well in the center, and ladle the hot goulash into the well so the rich gravy runs into the mash."
  ],
  "macros": {
    "per_100g": {
      "cals": "118 kcal",
      "carbs": "6.8 g",
      "fat": "5.9 g",
      "protein": "9.7 g"
    },
    "total": {
      "cals": "3120 kcal (entire pot, serves 8–10)",
      "carbs": "180 g",
      "fat": "156 g",
      "protein": "255 g"
    }
  }
}

